Revit 2027 API
UIApplication.DrawingAreaExtents Property
Get the rectangle that represents the screen pixel coordinates of drawing area.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual Rectangle DrawingAreaExtents { get; }
Public Overridable ReadOnly Property DrawingAreaExtents As Rectangle
	Get
public:
virtual property Rectangle^ DrawingAreaExtents {
	Rectangle^ get ();
}
abstract DrawingAreaExtents : Rectangle with get
override DrawingAreaExtents : Rectangle with get
Property Value
Rectangle
Remarks
The drawing area of the Revit window displays views (and sheets and schedules) of projects. The size of drawing area restricts the max size of the view titles and windows, the value may be empty if modal browser is opened. If there is no project opened, null will be returned.
See Also
Reference
UIApplication Class
Autodesk.Revit.UI Namespace